app/views/users/show.html.erb

      <p class="text-xl"><%= post.text %></p>
      <span class="ml-[85%] mt-2">Comments: <%= post.comments.length %></span>
      <span class="ml-2 mt-2">Likes: <%= post.likes.length %></span>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 2]]