app/views/posts/index.html.erb

            <% if post.comments.any? %>
               <% post.comments.first(5).each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" DESC LIMIT $2  [["post_id", 1], ["LIMIT", 5]]