app/views/posts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 161]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 2]]
---
      <div>
        <h2 class="font-semibold text-2xl"><%= post.title %> by <%= User.find(post.author_id).name %></h2>
        <p class="text-xl"><%= post.text %></p>
        <span class="ml-[85%] mt-2">Comments: <%= post.comments.length %></span>
        <span class="ml-2 mt-2">Likes: <%= post.likes.length %></span>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
        <li class="hover:cursor-pointer">
          <span class="font-semibold"><%= User.find(comment.author_id).name %>:</span>