app/models/post.rb

  def update_user_post_counter
    user.update(posts_counter: user.posts.count)
---
UPDATE "users" SET "posts_counter" = COALESCE("posts_counter", 0) + $1 WHERE "users"."id" = $2  [["posts_counter", 1], ["id", 1]]